app/Http/Controllers/FormDataController.php

select `id`, `name`, `created_at` from `form_data`
---
    public function index()
    {
        $forms=FormData::all(['id','name','created_at']);

select * from `form_data` where `form_data`.`id` is null limit 1
---
                ['id'=>$request->previous_form_id],
                $data
            );
            $form = FormData::find($request->previous_form_id);