app/Http/Controllers/Admin/RoleController.php

select * from `form_data` where `form_data`.`id` = 3 limit 1
---
    public function index()
    {
        $form=FormData::find(3);