app/Http/Controllers/Admin/RolePermissionController.php

select * from `roles`
---
    public function roleIndex()
    {
        try {
            $roles = Role::get();